
## Plan Result




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.caseDisposerAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "caseDisposerAlertEmail"  {
      + content_type   = (known after apply)
      ~ id             = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail/e0832aa834754272aed8cc587f97507f" -> (known after apply)
        key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
        name           = "caseDisposerAlertEmail"
      ~ tags           = {
          - "file-encoding" = "utf-8"
        } -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = "e0832aa834754272aed8cc587f97507f" -> (known after apply)
      ~ versionless_id = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail" -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat|lau-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "lau-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Vars":{}} -->